Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F01B.tmx
Source language: en_us
Languages: zh_cn

source: Create the Life of Your Dreams
zh_cn: 创造梦想生活

source: Last night I had a terrifying nightmare.
zh_cn: 昨晚，我做了一个可怕的噩梦。

source: I dreamt that I was trapped in someone else's life.
zh_cn: 我梦到自己困在别人的生活里。

source: But not just anyone else's life.
zh_cn: 还不是随便一个什么人的生活。

source: I was trapped in my own life.
zh_cn: 是我自己的生活。

source: The one I had 5 years ago.
zh_cn: 我五年前的生活。

source: A life I created for myself for all the wrong reasons.
zh_cn: 一个完全出于错误原因才创造了的生活。

source: A life that made me feel empty and miserable.
zh_cn: 一个让我感到痛苦和空虚的生活。

source: Have you ever felt like that?
zh_cn: 你有过这样的感觉么？

source: Waking up one day and realizing the life you're living is not really yours.
zh_cn: 一天睡起觉来发现生活不是自己的。

source: Wondering: "How did I even get here?"
zh_cn: 想“我是怎么到这来的”。

source: Have you ever experienced that horrifying feeling of being a captive of your fears, doubts, and insecurities?
zh_cn: 困在自己的恐惧、怀疑、不安里，你有过这样恐怖的感觉么？

source: Like a straightjacket you just can't get out of.
zh_cn: 就像一件脱不掉的紧身衣。

source: Feeling like a prisoner in a life that you chose for yourself.
zh_cn: 感觉就像困在所选生活中的囚徒。

source: A life that nobody forced you into.
zh_cn: 一个没人逼你这样过的生活。

source: But that still feels as suffocating as prison itself.
zh_cn: 但是仍感觉就像监狱一样让人窒息。

source: So this nightmare I had was a "not so friendly" reminder of how we should NEVER settle for a life that's not the life of our dreams.
zh_cn: 所以我做的这个噩梦可是恶狠狠地提醒了我们绝不应为非梦想的生活停留。

source: How we are each capable of creating our own destiny.
zh_cn: 也提醒了我们每个人都能创造自己的未来。

source: And how we should never stop pursuing a path that reflects who we want to be.
zh_cn: 也让我们知道我们决不应该停止追求做想做自己的道路。

source: As scary as change is, there's nothing scarier than realizing you're wasting your life away.
zh_cn: 就像改变一样可怕，没什么比发现自己在浪费生命更吓人了。

source: Living full of regrets because you failed to follow your heart.
zh_cn: 活着充满悔恨只因自己未随心动。

source: Because you didn't have the courage to explore beyond the ordinary. The safe. The practical. The acceptable.
zh_cn: 只因没有勇气打破常规、冲出安全、现实、易于接受的生活。

source: Determination is all we need to cross the bridge between where we are now and where we want to be.
zh_cn: 决心就是跨越现在与梦想间桥梁所需的一切。

source: It means wanting it enough that we're willing to do whatever it takes to get there.
zh_cn: 这意味我我们对梦想极其渴望以至于我们愿意付出所有为之实现。

source: I built my own destiny when I took charge of my life and created the changes I needed: I ended a loveless "marriage" to enter into a new one that now fulfills me.
zh_cn: 在掌控了生活后，我开始构建自己的未来，并做出所需的改变：我终止了一段无爱婚姻，为追求崭新且让我满足的婚姻生活。

source: I would have never found out what real love is if I had settled for the comfort of familiar companionship.
zh_cn: 如果我安享于有家庭伴侣的舒适感，我永远都不会知道何为真爱。

source: I shifted from a successful yet unsatisfying career to one that now fills me with passion and energy.
zh_cn: 我从原来成功却难以让我满意的事业中转到现在让我充满热情和能量的工作里。

source: I learned that when you follow your calling you find a sense of purpose that makes life splendid.
zh_cn: 我认识到当你听从内心召唤，你会拥有一种要让生活变美好的使命感。

source: I changed my home and moved to a different country to start a whole new life from zero.
zh_cn: 我搬了家，在另一个国家从零开始了新生活。

source: Learning what it's like to stand on my own feet.
zh_cn: 了解到什么是依靠自己。

source: Realizing how I'm much stronger than I thought I was.
zh_cn: 意识到自己比想象中强大多少。

source: Most importantly, I changed myself.
zh_cn: 最重要的是，我改变了自己。

source: Challenging those limiting beliefs about who I thought I was.
zh_cn: 挑战了那些自我认识的条条框框。

source: I allowed myself the opportunity to discover who I really am. Not who I should be. But who I'm meant to be.
zh_cn: 我给予自己了一个机会发现自己是谁，不是我应该是谁，而是我想要是谁。

source: I was suffocating and now I feel free.
zh_cn: 我曾感到窒息，现在我自由无比。

source: I was empty and now I feel rich.
zh_cn: 我曾空虚，现在我感到富有至极。

source: I was lost and now I've found purpose.
zh_cn: 我曾经迷失，现在我找到了生活意义。

source: So please believe me when I say, it is possible!
zh_cn: 所以当我说“这有可能”时，请相信我。

source: We are all capable of creating the life of our dreams.
zh_cn: 我们都能创造我们梦想的生活。

source: A life that will empower us to blossom into who we yearn to be.
zh_cn: 一个让我成长为我们希望样子的生活。

source: A life that will inspire us to thrive!
zh_cn: 一个让我们积极发展的生活。

source: I wish there was one secret formula for us to go from A to Z.
zh_cn: 我希望有一种秘密模式让我们循规蹈矩也能实现目标。

source: A roadmap that would lead us to where we want to be.
zh_cn: 希望有张地图带领我们走向想要的自己。

source: Unfortunately, we each have to find our own way.
zh_cn: 可惜，我们都得自己去探索自己的路。

source: But if I may, let me share with you what I learned along the way.
zh_cn: 但是如果可以，我想和你们分享这一路我学到的。

source: Steps you can take to start creating the life you've been dreaming of:
zh_cn: 一些可以用来创造梦想生活的方法。

source: Take a long, hard look at yourself
zh_cn: 1．仔细认真审视自己

source: If you're lost, admit that you are.
zh_cn: 如果你迷失了，就承认这个事实。

source: Engage in deep self-reflection and don't give up until you find clarity.
zh_cn: 要深刻反省，在重新找回自己之前别停下。

source: I promise you it will come.
zh_cn: 我保证，你会找到自己的。

source: If you are spiritual, pray or meditate.
zh_cn: 如果你感性，就祈祷冥想。

source: If you're rational, analyze yourself objectively (the help of an expert might facilitate the process).
zh_cn: 如果你理性，就客观分析自己（专家的帮助能简化此过程）。

source: In my case, it was after much reading, meditating, analyzing, and praying that I had my "aha" moment one random afternoon while watching the sunset in Hawaii.
zh_cn: 在我的例子中，我就是在大量阅读、冥想、分析和祈祷后，在某个下午，欣赏着夏威夷落日时，恍然大悟的。

source: It was so out of the blue, but suddenly everything became clear to me.
zh_cn: 这特别突然，但是一切瞬间都清晰了。

source: And through therapy, and much self-analysis, it became clearer with time.
zh_cn: 且通过治疗和大量自我分析，一切都是越来越清楚。

source: So be ready for that moment.
zh_cn: 所以准备好迎接这一时刻。

source: Accept whatever truth you find out about yourself.
zh_cn: 接受你所发现的关于自己的真相，不论这真相是什么。

source: And as intimidating as it may be, don't deny it or rationalize it.
zh_cn: 真相可能让你害怕，但是不要否认、理化它。

source: Take it all in.
zh_cn: 要彻彻底底接受它。

source: Take one small step in the right direction
zh_cn: 2．在正确方向上迈出一小步

source: Realizing you have been going down the wrong path for quite a while (a lifetime maybe) can be devastating.
zh_cn: 意识到自己已经在错误道路上蹉跎了很多岁月（有可能是一生）很打击人。

source: Especially when you've taken on responsibilities and have made life-changing choices that can't be easily reverted.
zh_cn: 尤其当你已经担起了诸多责任，改变人生已然不易时。

source: So breathe.
zh_cn: 那么深呼吸。

source: Don't try to change your world in a heartbeat because all you'll give yourself is a nervous breakdown.
zh_cn: 别试着瞬间就改变你的世界，因为这样能得到的不过是精神崩溃。

source: Realize that you won't change your whole life overnight.
zh_cn: 认识到你无法一夜之间彻底改变生活。

source: It will take time, patience, and perseverance.
zh_cn: 改变需要时间，耐心和坚持。

source: All it takes is one small step in the direction of your dreams to get started.
zh_cn: 要做的就是超梦想实现方向迈出一小步以启程。

source: For me, it was going to a bookstore that same day in Hawaii to buy the book "Psychology for Dummies".
zh_cn: 对我来说，这就是那天去夏威夷一家书店买下《傻瓜心理学》。

source: As ridiculous as it may sound, that step was the beginning of my transformational journey.
zh_cn: 尽管听起来可笑，但这就是我转变路上的第一步。

source: Get ready for a lonely ride
zh_cn: 3．准备好走一段孤独的旅程

source: A lesson I learned along the way is that while you change, everybody else stays the same.
zh_cn: 这一路上我学到的就是你改变时，其他人还是原样。

source: So don't assume people will understand.
zh_cn: 所以别假设人们能理解你。

source: Or that they will support you.
zh_cn: 或是他们会支持你。

source: I hope they do.
zh_cn: 我希望他们懂。

source: But if they don't, don't let it bring you down.
zh_cn: 但是如果他们不懂，别因此而沮丧。

source: The people that love you most will probably try to dissuade you the most too.
zh_cn: 最爱你的人可能也是劝你放弃最多的人。

source: Precisely because they love you.
zh_cn: 这就是因为他们爱你。

source: And they'll worry about you.
zh_cn: 而且他们担心你。

source: But don't let their opinion drown your inner voice.
zh_cn: 但是不要让他们淹没了你内心的声音。

source: You keep doing what's right for you.
zh_cn: 你坚持做对的事。

source: And with time, hopefully they'll understand.
zh_cn: 随着时间过去，但愿他们能理解。

source: And if they don't, they'll have no choice but to accept it.
zh_cn: 如果他们无法理解，他们也别无选择不得不接受。

source: A strong support system will make it feel less lonely.
zh_cn: 有一个坚强的后盾你会觉得不那么孤单。

source: But this ride will still be about you and only you. You and the world you're creating for yourself.
zh_cn: 但是这个旅程仍然是关于你而且只有你，还有你要为自己创造的世界。

source: Embrace the idea of a fresh new start
zh_cn: 4．拥抱这个主意—崭新开始

source: Thinking that we have to start all over again can be unnerving.
zh_cn: 想到不得不重头开始不禁让人不安。

source: Especially if we view all those years as wasted time.
zh_cn: 尤其是当我们把过去些年当作是浪费时间。

source: But nothing is ever wasted.
zh_cn: 但是其实我们并未浪费什么。

source: You live, you learn.
zh_cn: 你活着你成长。

source: That's just how it is.
zh_cn: 这才变成了现在这个样子。

source: These breakthrough experiences change us profoundly.
zh_cn: 这些突破经历深刻改变了我们。

source: They teach us invaluable lessons that we wouldn't have learned otherwise.
zh_cn: 他们教会了我们本不会知道的事情。

source: The pain we experience helps us grow.
zh_cn: 所经历过的痛苦助我们成长。

source: Plus, starting with the lightness of a clean slate is not that bad.
zh_cn: 还有，从零开始并不糟糕。

source: It gives us a second opportunity at life.
zh_cn: 这给了我们第二次生活的机会。

source: And this time, we can make decisions out of love and courage, rather than fear and insecurity.
zh_cn: 这次，我们可以出于爱和勇气而非害怕和不安做决定。

source: This time we can create our own unique path.
zh_cn: 这一次我们能创造独有的道路。

source: And despite the outcome, we'll feel free and powerful in mind and spirit because we'll know that we followed our heart.
zh_cn: 而且不管结果如何，我们心中会感到自由而有力量，这是因为我们知道我们是随心而动。

source: Keep walking, no matter what
zh_cn: 5．一直走下去，无论如何

source: I'm not going to lie to you.
zh_cn: 我不想骗你。

source: It will get ugly.
zh_cn: 生活会变得面目可憎。

source: No doubt about that.
zh_cn: 毫无疑问。

source: But regardless of what happens, you have to keep moving forward.
zh_cn: 但是别管发生了什么，你必须向前走。

source: There is no turning back.
zh_cn: 没有回头路。

source: And as dreadful as the road may seem, you have to believe it will get better.
zh_cn: 尽管这路看起来可怕极了，但是你必须相信会好起来。

source: It will probably get worse before it gets better, but ultimately the sun will come out again.
zh_cn: 在变好之前生活会变得更糟，但是最终太阳会升起来。

source: It will be like a dark and frightful tunnel that you'll have to go through.
zh_cn: 这就像是你不得不通过的一条黑暗吓人的通道。

source: Because you won't recognize anything around you. Not even yourself.
zh_cn: 因为你看不清周围一切，甚至自己。

source: But I promise you, at the end of that tunnel, you'll find the light you've been looking for.
zh_cn: 但是我保证，在通道尽头，你会看到你寻找以久的光。

source: Realize it is a journey, not a destination
zh_cn: 6．要认识到这是一段旅程，而非一个终点

source: As much as I'd like to say once you're on the other side you'll be set for life, the truth is, creating the life of your dreams is a journey that will never end.
zh_cn: 尽管我想说你现在的生活和将要打造的生活完全是两极，但事实是，创造梦想生活是永不终结的旅程。

source: You'll have to work at it every day. The good news is, the more you work at it, the easier it'll get.
zh_cn: 你每天都要为之努力，你越努力，就越容易得到梦想的生活。

source: And after what will seem like an eternal transition, one day you'll realize you feel comfortable again.
zh_cn: 在某个看似永久的转变后，一天你会意识到自己又感到舒服了。

source: And this time, not only comfortable. But happy. Truly happy. And content.
zh_cn: 这次，不仅仅是舒服自在，还快乐。是真正的快乐，和满足。

source: When you settle for less, you get less than what you settled for.
zh_cn: 当你没有实现梦想生活，你得到的也就比在梦想生活的少。

source: You become consumed by feelings of self-loathing, helplessness, and apathy.
zh_cn: 你会唉声叹气、感到无助、对人冷漠。

source: You stop living. And start surviving.
zh_cn: 你不在生活，而只是活着。

source: So don't settle for a life that's not worthy of you.
zh_cn: 所以别在配不上你的生活中安定。

source: You deserve so much more.
zh_cn: 你值得更多。
